# 1) შექმენით 5 ელემენტიანი მანქანების სია და დაბეჭდეთ

# 2) შექმნილი სიიდან დაბეჭდეთ, მე-3 ელემენტი

# 3) იგივე სიიდან დაბეჭდეთ მე-3 ინდექსზე მდგომი ელემენტი

# 4) შექმენით 7 ელემენტიანი სახელების სია და შეცვალეთ მასში 1-ლი და მე-5 ინდექსზე მყოფი ელემენტები სხვა ნებისმიერი სახელით.

# შემდეგ დაბეჭდეთ განახლებული სია.

# 5) ამ სიაში რომელიმე ორ ელემენტს გაუცვალეთ ადგილები

# Task 1
manqana=["car1", "car2", "car3", "car4", "car5"]
print(manqana)

# Task 2
print(manqana[2])

# Task 3
print(manqana[3])

# Task 4
names=["mari", "gio", "saba","inga", "cici","nika", "lizi"]
names[1], names[5]= "lana", "nuki"
print(names)

# Task 5
names[2], names[4] = names[4], names[2]
print(names)