# 1) შექმენით სია შემდგარი მინიმუმ 10 ელემენტისგან და დაბეჭდეთ მისი სიგრძე(მასში ელემენტთა რაოდენობა). 
# ამისათვის გამოიყენეთ დღეს ნასწავლი len ფუნქცია

# 2) შექმენით ცვლადი სადაც შეინახავთ თქვენს სახელს და დაბეჭდეთ მისი სიგრძე(მასში სიმბოლოთა რაოდენობა)

# 3) პირველ დავალებაში შექმნილ სიას დაუმატეთ ორი ელემენტი(მაგალითად ორი სახელი) .append ფუნქციის გამოყენებით და
#  ყოველი ცვლილების შემდეგ დაბეჭდეთ განახლებული სია.

# საბოლოოდ ისევ დაბეჭდეთ ამ სიის სიგრძე

# Task 1
list=[1,2,3,4,5,6,7,8,9,10]
print(len(list))

# Task 2
name="Inga"
print(len(name))

# Task 3
list.append(11)
print(len(list))

list.append(12)
print(len(list))

# 4) შექმენით 5 ელემენტიანი სახელების სია. მე-4 და მე-5 ელემენტებს შორის ჩაამატეთ ახალი სახელი.

# იგივე სიის თავში ჩაამატეთ კიდევ ერთი სახელი და დაბეჭდეთ მიღებული სია.

# 5) მე-4 დავალებაში შექმენილ სიაში წაშალეთ ბოლო და მე-2 ინდექსზე მყოფი ელემენტები

# Task 4 
names=["Maia", "Nino", "Inga", "gio", "saba" ]
names.insert(4,"Lasha")
print(names)

# Task 5
names.pop()
print(names)
names.pop(2)
print(names)