# 2) კომენტარებით ახსენით რა არის return keywor-ი დეტალურად და მოიყვანეთ მაგალითი,
#  სადაც მას იყენებთ და დეტალურად აღწერეთ აქაც თითოეული ნაბიჯი
# 3) შექმენით ფუნქცია, რომელსაც გადაეცემა რიცხვების სია და პასუხად აბრუნებს
#  თითოეული რიცხვის ნამრავლს. გამოიძახეთ ეს ფუნქცია, გადაეცით მას სასურველი სია 
# და ჩასვით ის print-ში.

# 4) შექმენით ფუნქცია, რომელსაც გადაეცემა რაღაც რიცხვი და ის აბრუნებს
#  მას, შემდეგ შექმენით კიდევ ერთი ფუნქცია, რომელსაც ასევე გადაეცემა რაღაც რიცხვი.

# გამოძახეთ მეორე ფუნქცია და არგუმენტად გადაეცით პირველი ფუნქციის გამოძახება, 
# რომელსაც გადასცემთ თქვენთვის სასურველ რიცხვს. მიღებული პასუხი შეინახეთ ცვლადში
#  და დაბეჭდეთ

# Task 2
# return ის საშუალებით ფუნქციას ვატყობინებთ, თუ რა მნიშვნელობა უნდა დაგვიბრუნოს, როდესაც მას გამოვიძახებთ.
# ის ასევე ამთავრებს ფუნქციას. თუ ფუნქციაში დავწერეთ return  და შემდეგ გავაგრძელეთ მასში კოდის წერა, ის აღარ წაიკითხება.
def average(num1,num2,num3,num4,num5): # შევქმენით ფუნქცია, პარამეტრებად გადავეცით ხუთი რიცხვი
    jami=num1+num2+num3+num4+num5  #განვსაზღვრეთ რომ ცვლადი jami არის ამ ხუთი რიცხვის ჯამი
    sashualo=jami/5 # შევქმენით ცვლადი sashualo, რომელიც ამ ხუთი რიცხვის საშუალოს უდრის
    return sashualo # ფუნქციას ვატყობინებთ რომ უნდა დაგვიბრუნოს sashualoს მნიშვნელობა

print(average(2,4,6,8,5))
# ეს არის ფუნქცია, რომელიც აბრუნებს 5 რიცხვის საშუალოს. 

# Task 3
def function(list):
    namravli=1
    for i in list:
        namravli*=i
    return namravli

sia=[2,5,3,7]
print(function(sia))

# Task 4
def funkcia1(num):
    return num

def funkcia2(num):
    return num

pasuxi=funkcia2(funkcia1(7))
print(pasuxi)