# 2) კომენტარებით ახსენით რისთვის გვჭირდება int ფუნქცია და როგორ მუშაობს ის. მოიყვანეთ მაგალითები.

# 3) მომხმარებელს შემოატანინეთ 5 რიცხვი და გაიგეთ მათი საშუალო არითმეტიკული

# 4) კომენტარების სახით ჩამოწერეთ ყველა ნასწავლი მონაცემთა ტიპი. დაახასიათეთ ისინი და თითოეულზე მოიყვანეთ 3-3 მაგალითი

# Task 2
# int ფუნქცია გვჭირდება იმისთვის, რომ კომპიუტერს გავაგებინოთ, გვინდა მთელი რიცხვითი მონაცემის მიღება ან შენახვა და არა- ტექსტური მონაცემის.
# მაგ: input() აუცილებლად ინახავს ტექსტურ მონაცემს, თუმცა ჩვენ შეიძლება გვინდოდეს, რომ მომხმარებელის შემოყვანილ რიცხვებზე რაიმე
# მათემატიკური ოპერაციები ჩავატაროთ, ამიტომ მსგავს შემთხვევაში input() უნდა ჩავსვათ int()-ში. 

# Task 3
print("შემოიტანეთ 5 რიცხვი ")
num1=int(input())   
num2=int(input())
num3=int(input())
num4=int(input())
num5=int(input())

sashualo= (num1+num2+num3+num4+num5)/5
print(sashualo)

# Task 4
# string- ტექსტურ მონაცემეს ინახავს. მაგ: "Inga", "Hello", "5"
# int- ინახავს მთელ რიცხვებს. მაგ: 20 , 55 ,  1
# float- ინახავს ათწილად რიცხვებს. მაგ: 4.3 , 5.5 , 100.2 