# 2) კომენტარებით ახსენით რა არის Boolean და binary code

# 3) ისწავლეთ ყველა შედარების ოპერატორი და გააკეთეთ მაგალითები

# 4) გადახედეთ რესურსებში მოცემულ მაგალითებს ლოგიკურ ოპერატორებზე და გააკეთეთ 5 მაგალითი, სადაც გამოიყენებთ შედარების და ლოგიკურ ოპერატორებს

# 5) მომხმარებელს შემოატანინეთ რიცხვი და თუ ის არის ლუწი ან იყოფა 5-ზე დაბეჭდეთ True, სხვა ნებისმიერ შემთხვევაში დაბეჭდეთ False(დაგჭირდებათ %-გაყოფა)

#Task 2
#boolean code -ში გვაქვს true, false- მნიშვნელობები.თუ დავწერთ მაგალითად print(5>7) დაიბეჭდება boolean მნიშვნელობა- false.   
#binary code- ორობითი კოდია, სადაც მხოლოდ 0, 1 ციფრები გვაქვს. ნებისმერი რიცხვი შეგვიძლია გამოვსახოთ 0, 1- ების საშუალებით

#Task 3 
#გვაქვს შემდეგი შეედარების ოპერატორები: >, <, <=, >=, ==, !=
# == ტოლობას აღნიშნავს, != კი- "არ უდრის"
print(90 > 10)  #true
print(55 < 105)  #true
print(125 >= 125)  #true
print(99 <= 300)  #true
print(7 == 5)  #false
print( 30 != 9)  #true

#Task 4
print(5>3 and 7>3) # True
print(9>1 and 4<2) # False
print(2==3 and 5==9) # False
print(4>9 and 4==3) # False

print(5!=4 or 5>=5) # True
print(4>3 or 4<=1) # True
print(4!=4 or 5>3) # True
print(15<3 or 5==2) # False

# Task 5 

num1=int(input("shemoitanet ricxvi"))
print(num1 % 2 == 0 or num1%5==0 )