# 2) კომენტარებით ახსენით რა არის ფუნქცია და როგორ გვიმარტივებს ის კოდის წერის პროცესს

# 3) კომენტარებით ახსენით რა არის არგუმენტი

# 4) კომენტარებით ახსენით რა არის dot ნოტაცია და როგორ ფუნქციებზე იყენებენ მას

# 5) დღეს ნასწავლ ფუნქციებზე გააკეთეთ 5-5 რთული მაგალითი

# Task 2
# ფუნქცია გამოიყენება იმისთვის, რომ თუ მაგალითად კოდის წერისას ბევრჯერ გვჭირდება სხვადასხვა რიცხვების საშუალოს გამოთვლა,
# ერთხელ დავწეროთ კოდი საშუალოს გამოსათვლელად, ამ ფუნქციას სახელი დავარქვათ და როდესაც დაგვჭირდება ამ სახელით გამოვიძახოთ.

# Task 3 
# არგუმენტი არის ის მნიშვნელობა, რომელიც გადაეცემა ფუნქციას. 

# Task 4
# dot notation გამოვიყენებთ სტრინგებთან და ნიშნავს, რომ ფუნქციას ვიძახებთ არა პირდაპირ სახელის დაწერითა და მნიშვნელობის გადაცემით, არამედ სტრინგს ვუწერთ წერტილს და შემდეგ ფუნქციის სახელს.

# Task 5

word="HeLlo"
if word.upper()=="HELLO":
    print("HI")

for i in range(3):
    print(word.lower())

word1="How are you?"
for i in range (2):
    if word.capitalize()=="Hello":
        print(word1.title())

if word.find("E")==-1 :
    print(word +"'s second letter is in lowercase.")


