word="Hello"
print(word*5)
# შედეგია Hello მიყოლებით 5-ჯერ

# Task 2
# კომენტარი გამოიყენება იმისთვის, რომ ჩვენს თავს გავახსენოთ რომელი კოდი რა მიზნით დავწერეთ 
# ან ავუხსნათ ის ჩვენთან ერთად მომუშავე სხვა პროგრამისტებს.

# კომენტარების გამოყენება კარგი პრაქტიკაა ზუსტად იმის გამო, რაც მაღლა ვახსენე. როდესაც დიდ კოდს წერ,
# შეიძლება დაგავიწყდეს თითოეული კოდის მიზანი, შესაბამისად კომენტარების წაკითხვა გაამარტივებს მუშაობას. 
# ასევეა სხვა პროგრამისტის კოდის გააზრებაც უფრო მარტივია იქანება თუ ის მიუწერს კომენტარებს. 

#Task 3

# 4) შექმენით 2 ცვლადი, სადაც შეინახავთ თქვენს სახელს და გვარს. თქვენი დავალებაა დღეს ნასწავლი კონკადინაციის მეშვეობით დაბეჭდოთ
#  შემდეგი ტექსტი.

num1=5
num2=2.5
namravli= num1 * num2
print(namravli*namravli)

#Task 4

saxeli="Inga"
gvari="Baghduashvili"

print("Hello, my name is "+saxeli+" and my surname is "+gvari)


"Hello, my name is {თქვენი სახელი} and my surname is {თქვენი გვარი}."