# შექმენით რიცხვების სია, სადაც გექნებათ 10 ელემენტი და დაბეჭდეთ

# 1) დაბეჭდეთ ამ სიის მეხუთე ელემენტი
# 2) დაბეჭდეთ ამ სიის მეშვიდე ინდექსზე მდგომი ელემენტი
# 3) დაბეჭდეთ ეს სია თავიდან ბოლომდე slicing-ის გამოყენებით
# 4) დაბეჭდეთ ეს სია შემოტრიალებულად
# 5) დაბეჭდეთ ამ სიის ყოველი მე-4 ელემენტი
# 6) დაბეჭდეთ ან სიის პირველი ელემენტიდან მე-5 ელემენტის ჩათვლით ყველა ელემენტი
# 7) დაბეჭდეთ ამ სიი პირველი ინდექსიდან მე-8 ინდექსის ჩათვლით ყოველი მე-2 ელემენტი
# 8) შეცვალეთ ამ სიის მე-2 ელემენტი თქვენი სახელით და დაბეჭდეთ სია
# 9) შეცვალეთ ამ სიის მე 2 ინდექსზე მყოფი ელემენტი თქვენი მეოგობრის სახელით და დაბეჭდეთ სია
# 10) გაუცვალეთ სიაში მე-2 და მე-3 ელემენტებს ადგილები და დაბეჭდეთ სია

sia=[1,2,3,4,5,6,7,8,9,10]

# Task 1
print(sia[4])

# Task 2
print(sia[7])

# Task 3
print(sia[::])

# Task 4
print(sia[::-1])

# Task 5
print(sia[::4]) # ან
print(sia[3::4])

# Task 6
print(sia[:5:])

# Task 7
print(sia[1:9:2])

# Task 8
sia[1]="Inga"
print(sia[::])

# Task 9
sia[2]="mari"
print(sia[::])

# Task 10
sia[1], sia[2] = sia[2], sia[1]
print(sia[::])