#  2) კომენტარებით ახსენით რა არის ალგორითმი.

# 3) კომენტარებით ახსენით რა არის sequencing, iteration, selection, მოიყვანეთ რეალური ცხოვრების მაგალითი სამივე მათგანზე.

# 4) კომენტარებით ახსენით რა არის flowchart-ი, pseudo code და natural language. შეეცადეთ შექმნათ მარტივი ალგორითმი
# (კოდი რომელიც რაღაც დავალებას შეასრულებს), შემდეგ კი აღწეროთ ის სამივე ტექნიკის გამოყენებით. 

#  Task 2 
#  ალგორითმი არის რაიმე ამოცანის შესასრულებლად გაწერილი თანმიმდევრობით პირობათა ერთობლიობა.  

#  Task 3 
#  sequencing - ნიშნავს, რომ კომპიუტერი კოდს კითხულობს და უშვებს თანმიმდევრობით, მაღლიდან ქვემოთ. ჯერ იმ კოდს კითხულობს, რომელიც პირველი წერია და შემდეგ მის ქვემოთ დაწერილ კოდებს. 
#  მაგალითად შეგვიძლია ავიღოთ რაიმე საჭმლის რეცეპტი. ნებისმიერ რეცეპტში თანმიმდევრობით უნდა შეასრულო მოქმედებები სასურველი შედეგის მისაღებად.
#  iteracion - ნიშნავს, განმეორებით მოქმედებას.  მაგალითად სიმღერის განმეორებით  ჩართვა იტერაციის მაგალითია. 
#  selection - ნიშნავს, რომ გვაქვს რაღაც პირობა და იმის მიხედვით, არის თუ არა ეს პირობა ჭეშმარიტი, სრულდება სხვადასხვა მოქმედება. 
#  მაგალითად:  თუ კონდიციონერი ჩართულია- აგრილებს ოთახს, თუ არ არის ჩართული - არ აგრილებს. 

#  Task 4
# flowchart - არის ალგორითმის ვიზუალური გამოსახვა.
# natural language - ალგორითმის ადამიანური ენით დაწერა. 
