# 2) ვინც არ დასრულეთ საკლასო დავალება, აუცილებლად დაასრულეთ <3

# 3) შექმენით 5 ელემენტიანი რიცხვების სია, თქვენი დავალებაა დაბეჭდოთ ამ სიაში მყოფი რიცხვების ლუწ/კენტობა, შედეგი გააფორმეთ შესაბამისად 

# 4) შექმენით 5 ელემენტიანი სია და დაბეჭდოთ თითოეული მნიშვნელობა for ციკლის დახმარებით

# 5) შექმენით 4 ელემენტიანი რიცხვების სია, თქვენი დავალებაა დაბეჭდოთ ამ სიაში მყოფი რიცხვები გაორმაგებული მნიშვნელობის სახით

# Task 3
list=[2,5,3,8,12]
for i in list:
   if i%2==0:
      print(str(i)+" ლუწია")
   else: 
      print(str(i)+" კენტია")

# Task 4
list=[2,5,3,8,12]
for i in list:
   print(i)

# Task 5 
list=[2,5,3,8]
for i in list:
   print(2*i)