# 1) კომენტარებით დეტალურად ახსენით რა არის ფუნქცია.
# ისაუბრეთ მის შექმნაზე და გამოძახებაზე

# 2) შექმენით ფუნქცია test, რომელიც დაბეჭდავს ნებისმიერ წინადადებას.
# შემდეგ გაუშვით კოდი და კომენტარებით ახსენით რატომ არ გამოიტანა ტერმინალში ამ ფუნქციამ პასუხი.

# შემდეგ გამოიძახეთ ეს ფუნქცია 3-ჯერ და გაუშვით კოდი


# 3) შექმენით ფუნქცია, რომელიც მომხმარებლისგან მიიღებს 5 რიცხვს და დაბეჭდავს მათ საშუალო არითმეტიკულს.
# რიცხვების შემოტანისთვის გამოიყენეთ for ციკლი და input ფუნქცია.

# 4) შექმენით sayHi, რომელიც დაბეჭდავს თქვენი სახლისთვის მისალმებას.

# შექმენით ცვლადი და შეინახეთ მასში ამ ფუნქციის გამოძახება, შემდეგ დაბეჭდეთ შექმნილი ცვლადი და ნახეთ შედეგი.
# კომენტარებით ახსენით თუ რატომ მიიღეთ ასეთი შედეგი

# Task 1
# ფუნქცია არის კოდის ბლოკი. მას ვქმნით მაშინ, როდესაც ერთი და იგივე კოდის გამოყენება გვჭირდება რამდენჯერმე.
# ვქმნით def keyword ით, შემდეგ ვწერთ ფუნქციის სახელს და ():  შეგვიძლია ფრჩხილებში გადავცეთ  სტრინგი, ინტეჯერი ან სხვა ელემენტი. 
# ვიძახებთ ფუნქციის სახელისა და ფრჩხილების დაწერით. თუ საჭიროა ფრჩხილებში უნდა მივუთითოთ მნიშვნელობებიც. 

# Task 2
def test():
    print( "haha")

test()
print(test())

# იმისთვის, რომ ფუნქციამ ტერმინალში პასუხი გამოიტანოს, ის უნდა ჩავწეროთ პრინტში. მაგ: print(test()). ეს გამოიტანს პასუხს.
# ფუნქცია გამოძახებისას მხოლოდ იმახსოვრებს შედეგს და შეგვიძლია ის შევინახოთ რაიმე ცვლადში, ეს ცვლადი კი დავბეჭდოთ.

# test() გამოაქვს ტერმინალში haha, რადგან ფუნქციაში გვიწერია print, თუმცა print(test()) არ გამოაქვს შედეგი, რადგან ფუნქციაში არ გვაქვს return
# მაგ:
def test():
    return "haha"

print(test())

# Task 3
def sashualo():
   
    jami=0
    for i in range(5):
        jami+=int(input("enter the number"))

    sashualo=jami/5
    return sashualo


# Task 4
def sayHi(name):
    print("hello" + name)