# 2) კომენტარებით ახსენით, რა არის სია და როგორ იქმნება ის
# 3) კომენტარებით ახსენით რა არის ინდექსი და მოიყავნეთ მისი გამოყენების 3 მაგალითი

# Task 2
# სია პითონში არის ცვლადი, რომელშიც ვინახავთ რამდენიმე მსგავს მნიშვნელობას. მაგალითად თუ გვინდა შევინახოთ უნივერსიტეტების სია, 
# ცვლადში UNIVERSITIES  შევინახავთ კონკრეტულ უნივერსიტეტებს: TSU, BTU, ILIAUNI, GTU, GIPA
UNIVERSITIES=["TSU", "BTU", "ILIAUNI","GTU", "GIPA"]
print(UNIVERSITIES)

# Task 3
# ინდექსი არის კონკრეტული მნიშვნელობის ადგილი სიაში. სიაში დანომრვა იწყება 0 დან. პირველი ელემენტის ინდექსია 0, მეორე ელემენტის-1 და ა.შ
# ინდექსის დახმარებით შეგვიძლია სიიდან ერთი ელემენტი დავბეჭდოთ, ერთი ელემენტი ამოვშალოთ, ორ ელემენტს გავუცვალოთ ადგილი და ა.შ
# ზემოთ მოყვანილი მაგალითისთვის რომ დავბეჭდოთ მესამე ელემენტი დავწერთ შემდეგნაირად:
print(UNIVERSITIES[2])
# ინდექსით მესამე რომ დავბეჭდოთ:
print(UNIVERSITIES[3])
# რომ გავცვალოთ მესამე და მეხუთე მნიშვნელობები:
UNIVERSITIES[2], UNIVERSITIES[4]=UNIVERSITIES[4], UNIVERSITIES[2]
print(UNIVERSITIES)
