
# Task 2
#snake case არის ჩანაწერის ფორმა,  რომელსაც ვიყენებთ ცვლადის სახელთან. იმისთვის, რომ ორი სიტყვა გადაბმულად არ დავწეროთ და თვალისთვის უკეთ აღსაქმელი იყოს, ამ სიტყვებს შორის ვწერთ _  ქვედა ტირეს. 
# მაგ: srulisaxeli შეიძლება დამაბნეველი ჩანდეს და უცებ ვერ მივხვდეთ რა იგულისხმება, 
# sruli_saxeli  ამ შემთხვევაში კი ყველაფერი უფრო მარტივი დასანახია. 

# Task 3 
ricxvi1=input("shemoitanet ricxvi")
ricxvi2=input("shemoitanet meore ricxvic")
jami=ricxvi1+ricxvi2
print(jami)

# ეს ჯამი არ გამოიტანს ჩვენთვის სასურველ შედეგს, რადგან input ის დროს რასაც შემოიტანს მომხმარებელი ამას კომპიუტერი აღიქვამს,
# როგორს stringს, თუ გვსურს რომ რიცხვად აღიქვას, მაშინ input() უნდა ჩავსვათ int() -სა ან float()-ში. 