# 2) კომენტარებით ახსენით, რა არის snake case-ი

# 3) მომხმარებელს შემოატანინეთ ორი რიცხვი და დაბეჭდეთ მათი ჯამი. გატესტეთ კოდი და მოიძიეთ ინფორმაცია, თუ რატომ არ 
# დაიბეჭდა სასურველი შედეგი და როგორ შეიძლება ამ პრობლემის მოგვარება.(რიცხვების ჯამი არ გამოვა, ისინი უბრალოდ ერთმანეთს მიეწებებიან)

# 4) უყურეთ გაკვეთილის მეორე ნახევრის ჩანაწერს

# Task 2
#snake case არის ჩანაწერის ფორმა,  რომელსაც ვიყენებთ ცვლადის სახელთან. იმისთვის, რომ ორი სიტყვა გადაბმულად არ დავწეროთ და თვალისთვის უკეთ აღსაქმელი იყოს, ამ სიტყვებს შორის ვწერთ _  ქვედა ტირეს. 
# მაგ: srulisaxeli შეიძლება დამაბნეველი ჩანდეს და უცებ ვერ მივხვდეთ რა იგულისხმება, 
# sruli_saxeli  ამ შემთხვევაში კი ყველაფერი უფრო მარტივი დასანახია. 

# Task 3 
ricxvi1=input("shemoitanet ricxvi")
ricxvi2=input("shemoitanet meore ricxvic")
jami=ricxvi1+ricxvi2
print(jami)
