# Task 2
# გადახედეთ შემდეგ კოდს და ახსენით თითოეული მოქმედება კომენტარებით:

number = 5   # იქმნება Number ცვლადი და ენიჭება მნიშვნელობა 5
attempt = 3  # იქმნება attempt ცვლადი და ენიჭება მნიშვნელობა 3
user_input = ""  # იქმნება string ტიპის user_input ცვლადი. მნიშვნელობა ცარიელია 

while user_input != number and attempt > 0: # ვქმნით while ფუნქციას, თუ მომხმარებლის შემოყვანილი რიცხვი უდრის ჩვენს ჩაფიქრებულ რიცხვს და მცდელობების რაოდენობა მეტია 0-ზე:
    user_input = int(input("Guess the number between 1-10: ")) # ანუ თუ ორივე პირობა სრულდება, მაშინ user_input ს ვანიჭებთ ახალ მნიშვნელობას(რეინიციალიზაცია), ეს მნიშვნელობა მომხმარებელს შემოჰყავს. 
    attempt -= 1  # მცდელობების რაოდენობას ვამცირებთ ერთით, რადგან ერთხელ უკვე შემოიყვანა მომხმარებელმა რიცხვი
    
    if user_input == number: # თუ მომხმარებლის შემოყვანილი რიცხვი დაემთხვევა ჩვენს ჩაფიქრებულს, დავბეჭდავთ: you win
        print("You win!")
    elif attempt == 0: # თუ მცდელობების რაოდენობა ნულს გაუტოლდება, დავბეჭდავთ: you lose. მაგალითად, როდესაც სამჯერ არასწორ რიცხვს შემოიტანს.
        print("You lose!")
    else: # თუ სხვა პირობა შესრულდება ანუ მაგალითად მომხმარებელი არასწორ რიცხვს შემოიყვანს, მაგრამ მცდელობების რაოდნობა მეტი იქნება 0-ზე, დავბეჭდავთ: wrong number
        print("Wrong number!")
        print("You still have " + str(attempt) + " tries")