# 6) გაიმეორეთ for და while ციკლები, უყურეთ 20 გაკვეთილის ჩანაწერს და გააკეთეთ მათზე 3-3 მაგალითები

# 7) შექმენით ცარიელი საი და შეინახეთ ის ცვლადში. for ციკლის და input-ის დახმარებით მომხმარებელს შემოატანინეთ 5 რიცხვი და დაამატეთ ამ სიაში. საბოლოოდ დაბეჭდეთ ეს სია

# 8) მომხმარებელს ისევ შემოატანინეთ რიცხვი და მე-7 დავალებაში მიღებული სიის თავში ჩაამატეთ ეს რიცხვი აყვანილი მე-3 ხარისხში

# 9) გადაუარეთ იგივე სიას for ციკლით და წაშალეთ მისი ყოველი მეორე ელემენტი .pop ფუნქციის გამოყენებით. საბოლოოდ დაბეჭდეთ მიღებული სია

# 10) შექმენი ცარიელი სია. while ციკლის გამოყენებით მომხმარებელს შემოატანინე რიცხვი და სიაში დაამატე იქამდე, სანამ ის ნულს არ შემოიტანს.
# როგორც კი მომხმარებელი შემოიტანს ნულს while ციკლი უნდა გაითიშოს და დაიბეჭდოს მიღებული სია(თვითონ ნული არ უნდა ჩაემატოს)

# Task 6
i=0
while i<5:
    print("0")
    i+=1
print("1")


for i in range(4):
    print(i)

# Task 7
sia=[]
for i in range(5):
    ricxvi=int(input(" შემოიტანეთ რიცხვი "))
    sia.append(ricxvi)
print(sia)

# Task 8
ricxvi1=int(input(" შემოიტანეთ რიცხვი "))
axali_ricxvi=ricxvi1*ricxvi1*ricxvi1
sia.insert(0,axali_ricxvi)

print(sia)

# Task 9
for i in range(5,0,-2):
    sia.pop(i)
print(sia)

# Task 10 
sia=[]

while True :
    ricxvi=int(input("შემოიტანეთ რიცხვი"))
    if ricxvi!=0:
        sia.append(ricxvi)
    else:
        break
print(sia)


