# 1) კომენტარების სახით ახსენით რას აკეთებს in ოპერატორი და რაში გამოიყენება

# 2) შექმენით 5 ელემენტიანი სია. თქვენი დავალებაა გადაუაროთ მას და დაბეჭდოთ სიაში თითოეული
# მნიშვნელობა, გამოიყენებთ for ციკლი

# 3) მომხმარებელს შემოატანინეთ სახელი input-ის მეშვეობით, თქვენი დაბალებაა შეამოწმოთ არის თუ არა 
# მომხმარიბლის სახელი თქვენს მიერ წინასწარ გამზადებულ სახელების სიაში (სია უნდა იყოს 3 ელემენტიანი 
# ანუ 3 სახელი)

# 4) შექმენით 5 ელემენტიანი რიცხვების სია, თქვენი დავალებაა დათვალოთ ამ სიაში მყოფი რიცხვების ჯამი.

# 5) მომხმარებელს შემოატანინეთ ნებისმიერი რიცხვი, ასევე შექმენით 5 ელემენტიანი ნებისმიერი რიცხვვების სია. 
# თქვენი დავალებაა შეამოწმოთ თუ სიაში არის მომხმარებლის რიცხვი მაშინ დაუბეჭდეთ "რიცხვი არის საიში", სხვა
# შემთხვევაში "რიცხვი არაა სიაში"

# Task 1 
# in ოპერატორის დახმარებით ვამოწმებთ შედის თუ არა სასურველი ელემენტი სიაში. 
#  მაგ: list=[1, 2, 3, 4, 5]
#  for i in list:
#     print (i)
#  ამ შემთვევაში ფუნქცია გადაუვლის სიის ყველა ელემენტს და დაბეჭდავს მათ.

# Task 2
list=[1, 2, 3, 4, 5]
for i in list:
    print (i)
# Task 3
list=["Mari", "Nika", "Gio"]

name=input("shemoitanet tkveni saxeli")
if name in list :
    print("saxeli chvens siashia")
else :
    print("saxeli araa siashi")

# Task 4
list=[45, 65, 75, 34, 22]
jami=0
for i in list:
    jami+=i

print(jami)

# Task 5
list=[1, 2, 3, 4, 5]

num=int(input("shemoitanet ricxvi"))
if num in list:
    print("ricxvi aris siashi")
else :
    print("ricxvi araa siashi")