# 1) დაბეჭდეთ 0-დან 100-მდე ყველა რიცხვი. 

# 2) დაბეჭდეთ 0-დან 100-ის ჩათვლით ყველა რიცხვი.

# 3) დაბეჭდეთ 10-დან 20-მდე ყველე რიცხვი

# 4) დაბეჭდეთ 100-დან 200-ის ჩათვლით ყოველი მე-5 რიცხვი

# 5) დაბეჭდეთ 10-დან 0-ის ჩათვლით ყველა რიცხვი

# ეს დავალებები შეასრულეთ for loop-ის გამოყენებით

# Task 1 
for i in range(100):
    print(i)

# Task 2
for i in range(101):
    print(i)

# Task 3
for i in range(10,20):
    print(i)

# Task 4
for i in range(100,201,5):
    print(i)

# Task 5 
for i in range(10, -1, -1):
    print(i)